Repository: husseinhamed90/catalogat_app
Catalog: lib/l10n/app_*.arb
Languages: ar

# title_brandsAndProducts
source: Brands & Products
ar: البراندات والمنتجات

# title_add_brand_screen
source: Add Brand
ar: إضافة براند

source: Add Brand
ar: إضافة براند

# action_viewAll
source: View All
ar: عرض الكل

# action_edit
source: Edit
ar: تعديل

# action_delete
source: Delete
ar: حذف

# label_addBrandImage
source: Add brand image
ar: إضافة صورة للبراند

# label_brandName
source: Brand Name
ar: اسم البراند

# label_brandNameHint
source: Enter brand name
ar: أدخل اسم البراند

# error_requiredField
source: This field is required
ar: هذا الحقل مطلوب

# empty_brand_list
source: No brands available
ar: لا توجد براندات متاحة

# label_addFirstBrand
source: Start to add your first brand
ar: أضف أول براند لك

# action_editBrand
source: Edit Brand
ar: تحديث البراند

# title_edit_brand_screen
source: Edit Brand
ar: تحديث البراند

# action_deleteBrand
source: Delete Brand
ar: حذف البراند

# empty_product_list
source: No products available
ar: لا توجد منتجات متاحة

# label_addProductImage
source: Add product image
ar: إضافة صورة للمنتج

# label_productName
source: Product Name
ar: اسم المنتج

# label_productNameHint
source: Enter product name
ar: أدخل اسم المنتج

# label_price1
source: Price 1
ar: السعر

# label_price1Hint
source: Enter price 1
ar: أدخل السعر

# label_price2
source: Price 2
ar: سعر الجملة

# label_price2Hint
source: Enter price 2
ar: أدخل سعر الجملة

# label_selectBrand
source: Select Brand
ar: اختر البراند

# label_selectBrandHint
source: Select brand
ar: اختر البراند

# action_createProduct
source: Create Product
ar: إنشاء منتج

# title_add_product_screen
source: Add Product
ar: إضافة منتج

# action_editProduct
source: Edit Product
ar: تحديث المنتج

# title_edit_product_screen
source: Edit Product
ar: تحديث المنتج

# price_1_value
source: Price 1 :
ar: السعر :

# price_2_value
source: Price 2 : {price} EGP
ar: الجملة : {price} ج.م

# action_addBrand
source: Create Brand
ar: إضافة براند

# label_productCode
source: Product Code
ar: كود المنتج

# label_productCodeHint
source: Enter product code
ar: أدخل كود المنتج

# action_shopping
source: Shopping
ar: تسوق

# title_shopping_screen
source: Product Booking
ar: حجز المنتج

# currency
source: EGP
ar: ج.م

# label_totalPrice
source: Total Price
ar: السعر الكلي

# label_quantity
source: Quantity
ar: الكمية

# message_orderSuccess
source: Order placed successfully
ar: تم حجز المنتج بنجاح

# message_orderFailed
source: Order placement failed
ar: فشل حجز المنتج

# message_quantityZero
source: Quantity must be greater than zero
ar: الكمية يجب أن تكون أكبر من 0

# message_reportGenerated
source: Report generated successfully
ar: تم إنشاء التقرير بنجاح

# message_reportFailed
source: Report generation failed
ar: فشل إنشاء التقرير

# message_noOrders
source: No orders available yet
ar: لا توجد طلبات حتي الآن

# tab_name_existingCustomer
source: Existing Customer
ar: عميل موجود

# tab_name_newCustomer
source: New Customer
ar: عميل جديد

# label_companyName
source: Company Name
ar: اسم الشركة

# label_selectCustomer
source: Select Customer
ar: اختر عميل

# label_enterCustomerName
source: Enter Customer Name
ar: أدخل اسم العميل

# action_createOrder
source: Create New Order
ar: إنشاء طلب جديد

# action_generateCustomerOrdersReport
source: Generate Customer Orders Report
ar: إنشاء تقرير طلبات للعميل

# action_viewAllOrders
source: View All Orders
ar: عرض جميع الطلبات

# error_selectCustomer
source: Please select a customer
ar: الرجاء اختيار عميل

# error_enterCustomerName
source: Please enter customer name
ar: الرجاء إدخال اسم العميل الجديد

# label_orderValue
source: Order Value
ar: قيمة الاوردر

# label_addCustomer
source: Add Customer
ar: إضافة عميل

# label_companyLogo
source: Company Logo
ar: شعار الشركة

# action_addCustomer
source: Create Customer
ar: إضافة عميل

# action_save
source: Save
ar: حفظ

# title_edit_company_screen
source: Edit Company
ar: تحديث الشركة

# hint_companyName
source: Enter company name
ar: أدخل اسم الشركة

# hint_representativeName
source: Enter representative name
ar: أدخل اسم المندوب

# label_representativeName
source: Representative Name
ar: اسم المندوب

# label_customerName
source: Customer Name
ar: اسم العميل

# hint_customerName
source: Enter customer name
ar: أدخل اسم العميل

# title_add_customer_screen
source: Add Customer
ar: إضافة عميل

# message_companyInfoSaved
source: Company information saved successfully
ar: تم حفظ معلومات الشركة بنجاح

# message_companyInfoNotSaved
source: Failed to save company information
ar: فشل حفظ معلومات الشركة

# action_addToCart
source: Add to Cart
ar: إضافة إلى السلة

# message_itemAddedToCart
source: Item added to cart successfully
ar: تمت إضافة المنتج إلى السلة

# message_selectCustomer
source: Please select a customer
ar: الرجاء اختيار عميل

# message_invalidCompanyData
source: Please set company name and representative name
ar: برجاء تحديد اسم المندوب و اسم الشركة

# message_customerAddedSuccessfully
source: Customer added successfully
ar: تم إضافة العميل بنجاح

# message_customerAddedFailed
source: Failed to add customer
ar: فشل إضافة العميل

# action_view_pdf
source: View
ar: عرض

# created_at_value
source: Created at : {date}
ar: بتاريخ : {date}

# customer_name_value
source: Customer Name : {name}
ar: اسم العميل : {name}

# total_price_value
source: Total Price : {total} EGP
ar: قيمة الطلب : {total} ج.م

# title_orders_screen
source: Orders
ar: الأوردرات

# empty_orders_list
source: No orders available
ar: لا توجد أوردرات حتي الآن

# message_companyLogoRequired
source: Company logo is required
ar: شعار الشركة مطلوب

# error_invalidPrice
source: Price must be a number
ar: الرجاء إدخال سعر صالح
